{
  "alora_invocation_tokens": null,
  "alpha_pattern": {},
  "arrow_config": null,
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen3-4B-Instruct-2507",
  "bias": "none",
  "corda_config": null,
  "ensure_weight_tying": false,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 32,
  "lora_bias": false,
  "lora_dropout": 0.05,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "peft_version": "0.18.1",
  "qalora_group_size": 16,
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "model.layers.34.mlp.gate_proj",
    "model.layers.29.mlp.gate_proj",
    "model.layers.25.mlp.down_proj",
    "model.layers.5.self_attn.k_proj",
    "model.layers.13.self_attn.o_proj",
    "model.layers.26.self_attn.v_proj",
    "model.layers.8.self_attn.k_proj",
    "model.layers.35.self_attn.k_proj",
    "model.layers.4.self_attn.q_proj",
    "model.layers.35.self_attn.q_proj",
    "model.layers.14.mlp.gate_proj",
    "model.layers.30.self_attn.k_proj",
    "model.layers.12.self_attn.k_proj",
    "model.layers.1.self_attn.o_proj",
    "model.layers.7.self_attn.k_proj",
    "model.layers.10.self_attn.o_proj",
    "model.layers.8.self_attn.q_proj",
    "model.layers.11.self_attn.o_proj",
    "model.layers.0.mlp.gate_proj",
    "model.layers.2.self_attn.k_proj",
    "model.layers.11.mlp.gate_proj",
    "model.layers.27.self_attn.o_proj",
    "model.layers.7.self_attn.o_proj",
    "model.layers.13.mlp.gate_proj",
    "model.layers.28.self_attn.q_proj",
    "model.layers.26.mlp.up_proj",
    "model.layers.1.mlp.down_proj",
    "model.layers.4.self_attn.v_proj",
    "model.layers.9.mlp.down_proj",
    "model.layers.14.self_attn.q_proj",
    "model.layers.31.self_attn.v_proj",
    "model.layers.33.mlp.down_proj",
    "model.layers.2.self_attn.v_proj",
    "model.layers.34.mlp.up_proj",
    "model.layers.7.mlp.gate_proj",
    "model.layers.34.self_attn.o_proj",
    "model.layers.7.mlp.up_proj",
    "model.layers.30.self_attn.o_proj",
    "model.layers.0.self_attn.o_proj",
    "model.layers.28.mlp.up_proj",
    "model.layers.35.mlp.up_proj",
    "model.layers.8.mlp.gate_proj",
    "model.layers.33.mlp.up_proj",
    "model.layers.4.mlp.gate_proj",
    "model.layers.8.mlp.up_proj",
    "model.layers.33.self_attn.o_proj",
    "model.layers.32.self_attn.q_proj",
    "model.layers.3.self_attn.v_proj",
    "model.layers.7.mlp.down_proj",
    "model.layers.29.self_attn.q_proj",
    "model.layers.32.self_attn.v_proj",
    "model.layers.29.self_attn.o_proj",
    "model.layers.5.mlp.gate_proj",
    "model.layers.11.mlp.up_proj",
    "model.layers.13.mlp.down_proj",
    "model.layers.0.self_attn.v_proj",
    "model.layers.10.self_attn.k_proj",
    "model.layers.35.self_attn.o_proj",
    "model.layers.6.mlp.gate_proj",
    "model.layers.10.mlp.down_proj",
    "model.layers.25.self_attn.q_proj",
    "model.layers.29.self_attn.v_proj",
    "model.layers.34.self_attn.q_proj",
    "model.layers.26.self_attn.o_proj",
    "model.layers.12.self_attn.v_proj",
    "model.layers.4.mlp.up_proj",
    "model.layers.25.mlp.gate_proj",
    "model.layers.33.self_attn.k_proj",
    "model.layers.31.self_attn.o_proj",
    "model.layers.2.mlp.gate_proj",
    "model.layers.9.self_attn.q_proj",
    "model.layers.13.self_attn.k_proj",
    "model.layers.0.self_attn.q_proj",
    "model.layers.9.self_attn.v_proj",
    "model.layers.31.self_attn.k_proj",
    "model.layers.2.mlp.up_proj",
    "model.layers.3.mlp.up_proj",
    "model.layers.1.self_attn.q_proj",
    "model.layers.9.self_attn.k_proj",
    "model.layers.7.self_attn.q_proj",
    "model.layers.26.self_attn.q_proj",
    "model.layers.29.mlp.down_proj",
    "model.layers.3.self_attn.k_proj",
    "model.layers.27.self_attn.v_proj",
    "model.layers.12.mlp.gate_proj",
    "model.layers.5.self_attn.q_proj",
    "model.layers.3.mlp.gate_proj",
    "model.layers.25.mlp.up_proj",
    "model.layers.30.self_attn.q_proj",
    "model.layers.31.self_attn.q_proj",
    "model.layers.34.self_attn.v_proj",
    "model.layers.2.self_attn.o_proj",
    "model.layers.10.mlp.gate_proj",
    "model.layers.12.self_attn.q_proj",
    "model.layers.3.mlp.down_proj",
    "model.layers.13.self_attn.q_proj",
    "model.layers.32.self_attn.k_proj",
    "model.layers.9.mlp.gate_proj",
    "model.layers.0.mlp.down_proj",
    "model.layers.25.self_attn.k_proj",
    "model.layers.28.self_attn.v_proj",
    "model.layers.33.mlp.gate_proj",
    "model.layers.8.mlp.down_proj",
    "model.layers.31.mlp.down_proj",
    "model.layers.30.self_attn.v_proj",
    "model.layers.10.self_attn.v_proj",
    "model.layers.27.self_attn.k_proj",
    "model.layers.11.self_attn.v_proj",
    "model.layers.5.mlp.down_proj",
    "model.layers.6.self_attn.k_proj",
    "model.layers.26.self_attn.k_proj",
    "model.layers.2.mlp.down_proj",
    "model.layers.27.self_attn.q_proj",
    "model.layers.35.self_attn.v_proj",
    "model.layers.5.self_attn.o_proj",
    "model.layers.12.self_attn.o_proj",
    "model.layers.27.mlp.up_proj",
    "model.layers.28.self_attn.o_proj",
    "model.layers.1.self_attn.v_proj",
    "model.layers.30.mlp.gate_proj",
    "model.layers.29.self_attn.k_proj",
    "model.layers.31.mlp.gate_proj",
    "model.layers.32.mlp.gate_proj",
    "model.layers.32.self_attn.o_proj",
    "model.layers.13.self_attn.v_proj",
    "model.layers.4.mlp.down_proj",
    "model.layers.12.mlp.down_proj",
    "model.layers.0.self_attn.k_proj",
    "model.layers.10.self_attn.q_proj",
    "model.layers.6.mlp.up_proj",
    "model.layers.11.self_attn.k_proj",
    "model.layers.28.mlp.down_proj",
    "model.layers.11.mlp.down_proj",
    "model.layers.1.mlp.gate_proj",
    "model.layers.26.mlp.down_proj",
    "model.layers.14.self_attn.o_proj",
    "model.layers.3.self_attn.q_proj",
    "model.layers.3.self_attn.o_proj",
    "model.layers.5.mlp.up_proj",
    "model.layers.13.mlp.up_proj",
    "model.layers.28.mlp.gate_proj",
    "model.layers.33.self_attn.v_proj",
    "model.layers.7.self_attn.v_proj",
    "model.layers.35.mlp.gate_proj",
    "model.layers.25.self_attn.v_proj",
    "model.layers.6.self_attn.v_proj",
    "model.layers.35.mlp.down_proj",
    "model.layers.32.mlp.up_proj",
    "model.layers.34.mlp.down_proj",
    "model.layers.26.mlp.gate_proj",
    "model.layers.4.self_attn.o_proj",
    "model.layers.14.mlp.up_proj",
    "model.layers.6.mlp.down_proj",
    "model.layers.8.self_attn.v_proj",
    "model.layers.12.mlp.up_proj",
    "model.layers.14.self_attn.k_proj",
    "model.layers.9.self_attn.o_proj",
    "model.layers.30.mlp.up_proj",
    "model.layers.32.mlp.down_proj",
    "model.layers.0.mlp.up_proj",
    "model.layers.1.self_attn.k_proj",
    "model.layers.5.self_attn.v_proj",
    "model.layers.8.self_attn.o_proj",
    "model.layers.1.mlp.up_proj",
    "model.layers.6.self_attn.q_proj",
    "model.layers.30.mlp.down_proj",
    "model.layers.25.self_attn.o_proj",
    "model.layers.28.self_attn.k_proj",
    "model.layers.33.self_attn.q_proj",
    "model.layers.27.mlp.down_proj",
    "model.layers.14.self_attn.v_proj",
    "model.layers.27.mlp.gate_proj",
    "model.layers.34.self_attn.k_proj",
    "model.layers.2.self_attn.q_proj",
    "model.layers.10.mlp.up_proj",
    "model.layers.11.self_attn.q_proj",
    "model.layers.31.mlp.up_proj",
    "model.layers.9.mlp.up_proj",
    "model.layers.14.mlp.down_proj",
    "model.layers.6.self_attn.o_proj",
    "model.layers.4.self_attn.k_proj",
    "model.layers.29.mlp.up_proj"
  ],
  "target_parameters": null,
  "task_type": "CAUSAL_LM",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_qalora": false,
  "use_rslora": false
}